**Задание 1**
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [14]:
import pandas as pd

authors = pd.DataFrame(columns = ["author_id","author_name"], 
                       data = [
                           [1,'Turgenev'],
                           [2,'Chekhov'],
                           [3,'Ostrovsky']
                       ])
book = pd.DataFrame({
    "author_id" : [1, 1, 1, 2, 2, 3, 3],
    "book_title" : ['Otcy i deti', 'Rudin', 'Dvorjanskoe gnezdo', 'Tolstyj i tonkij', 'Dama s sobachkoj', 'Groza', 'Talanty i poklonniki'],
    "price" : [450, 300, 350, 500, 450, 370, 290]
})

   author_id            book_title  price
0          1           Otcy i deti    450
1          1                 Rudin    300
2          1    Dvorjanskoe gnezdo    350
3          2      Tolstyj i tonkij    500
4          2      Dama s sobachkoj    450
5          3                 Groza    370
6          3  Talanty i poklonniki    290

**Задание 2**
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [11]:
author_price = pd.merge(authors,book,on = "author_id")
author_price

   author_id author_name            book_title  price
0          1    Turgenev           Otcy i deti    450
1          1    Turgenev                 Rudin    300
2          1    Turgenev    Dvorjanskoe gnezdo    350
3          2     Chekhov      Tolstyj i tonkij    500
4          2     Chekhov      Dama s sobachkoj    450
5          3   Ostrovsky                 Groza    370
6          3   Ostrovsky  Talanty i poklonniki    290

**Задание 3**
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [13]:
top5 = author_price.sort_values("price",ascending = False)[:5]
top5

   author_id author_name          book_title  price
3          2     Chekhov    Tolstyj i tonkij    500
0          1    Turgenev         Otcy i deti    450
4          2     Chekhov    Dama s sobachkoj    450
5          3   Ostrovsky               Groza    370
2          1    Turgenev  Dvorjanskoe gnezdo    350

**Задание 4**
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [32]:
import numpy as np

authors_stat = pd.DataFrame(
    author_price.groupby("author_name").agg({
    "price":[np.min, np.max, np.mean]
})) 
authors_stat.columns = ["min_price", "max_price ", "mean_price"]
authors_stat

             min_price  max_price   mean_price
author_name
Chekhov            450         500  475.000000
Ostrovsky          290         370  330.000000
Turgenev           300         450  366.666667

**Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [46]:
import numpy as np

author_price["cover"] = ["hard", "soft","soft","hard","hard","soft","soft"]
book_info = author_price.pivot_table(values = ["price"], 
                         index = ["author_name"],
                         columns = ["cover"],
                         aggfunc = [np.sum],
                        fill_value = 0)

book_info.to_pickle("book_info.pkl")
book_info2 = pd.read_pickle("book_info.pkl")
book_info2 == book_info

              sum
            price
cover        hard  soft
author_name
Chekhov      True  True
Ostrovsky    True  True
Turgenev     True  True